Revit 2024 API
GeometryCreationUtilities.CreateSweptGeometry Method
Overload List
Name | Description
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>)
 Creates a solid by sweeping one or more closed coplanar curve loops along a path.
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, SolidOptions)
 Creates a solid by sweeping one or more closed coplanar curve loops along a path.
See Also
GeometryCreationUtilities Class
GeometryCreationUtilities Members
Autodesk.Revit.DB Namespace